{"ir_version": "0.1.0", "tox_version": "0.2.18", "enums": [{"object_name": "IREnum", "name": "ToxUserStatus", "cname": "Tox_User_Status", "values": [{"object_name": "IREnumValue", "name": "NONE", "cname": "TOX_USER_STATUS_NONE", "ordinal": 0}, {"object_name": "IREnumValue", "name": "AWAY", "cname": "TOX_USER_STATUS_AWAY", "ordinal": 1}, {"object_name": "IREnumValue", "name": "BUSY", "cname": "TOX_USER_STATUS_BUSY", "ordinal": 2}]}, {"object_name": "IREnum", "name": "ToxMessageType", "cname": "Tox_Message_Type", "values": [{"object_name": "IREnumValue", "name": "NORMAL", "cname": "TOX_MESSAGE_TYPE_NORMAL", "ordinal": 0}, {"object_name": "IREnumValue", "name": "ACTION", "cname": "TOX_MESSAGE_TYPE_ACTION", "ordinal": 1}]}, {"object_name": "IREnum", "name": "ToxProxyType", "cname": "Tox_Proxy_Type", "values": [{"object_name": "IREnumValue", "name": "NONE", "cname": "TOX_PROXY_TYPE_NONE", "ordinal": 0}, {"object_name": "IREnumValue", "name": "HTTP", "cname": "TOX_PROXY_TYPE_HTTP", "ordinal": 1}, {"object_name": "IREnumValue", "name": "SOCKS5", "cname": "TOX_PROXY_TYPE_SOCKS5", "ordinal": 2}]}, {"object_name": "IREnum", "name": "ToxSavedataType", "cname": "Tox_Savedata_Type", "values": [{"object_name": "IREnumValue", "name": "NONE", "cname": "TOX_SAVEDATA_TYPE_NONE", "ordinal": 0}, {"object_name": "IREnumValue", "name": "TOX_SAVE", "cname": "TOX_SAVEDATA_TYPE_TOX_SAVE", "ordinal": 1}, {"object_name": "IREnumValue", "name": "SECRET_KEY", "cname": "TOX_SAVEDATA_TYPE_SECRET_KEY", "ordinal": 2}]}, {"object_name": "IREnum", "name": "ToxLogLevel", "cname": "Tox_Log_Level", "values": [{"object_name": "IREnumValue", "name": "TRACE", "cname": "TOX_LOG_LEVEL_TRACE", "ordinal": 0}, {"object_name": "IREnumValue", "name": "DEBUG", "cname": "TOX_LOG_LEVEL_DEBUG", "ordinal": 1}, {"object_name": "IREnumValue", "name": "INFO", "cname": "TOX_LOG_LEVEL_INFO", "ordinal": 2}, {"object_name": "IREnumValue", "name": "WARNING", "cname": "TOX_LOG_LEVEL_WARNING", "ordinal": 3}, {"object_name": "IREnumValue", "name": "ERROR", "cname": "TOX_LOG_LEVEL_ERROR", "ordinal": 4}]}, {"object_name": "IREnum", "name": "ToxErrOptionsNew", "cname": "Tox_Err_Options_New", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_OPTIONS_NEW_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "MALLOC", "cname": "TOX_ERR_OPTIONS_NEW_MALLOC", "ordinal": 1}]}, {"object_name": "IREnum", "name": "ToxErrNew", "cname": "Tox_Err_New", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_NEW_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "NULL", "cname": "TOX_ERR_NEW_NULL", "ordinal": 1}, {"object_name": "IREnumValue", "name": "MALLOC", "cname": "TOX_ERR_NEW_MALLOC", "ordinal": 2}, {"object_name": "IREnumValue", "name": "PORT_ALLOC", "cname": "TOX_ERR_NEW_PORT_ALLOC", "ordinal": 3}, {"object_name": "IREnumValue", "name": "PROXY_BAD_TYPE", "cname": "TOX_ERR_NEW_PROXY_BAD_TYPE", "ordinal": 4}, {"object_name": "IREnumValue", "name": "PROXY_BAD_HOST", "cname": "TOX_ERR_NEW_PROXY_BAD_HOST", "ordinal": 5}, {"object_name": "IREnumValue", "name": "PROXY_BAD_PORT", "cname": "TOX_ERR_NEW_PROXY_BAD_PORT", "ordinal": 6}, {"object_name": "IREnumValue", "name": "PROXY_NOT_FOUND", "cname": "TOX_ERR_NEW_PROXY_NOT_FOUND", "ordinal": 7}, {"object_name": "IREnumValue", "name": "LOAD_ENCRYPTED", "cname": "TOX_ERR_NEW_LOAD_ENCRYPTED", "ordinal": 8}, {"object_name": "IREnumValue", "name": "LOAD_BAD_FORMAT", "cname": "TOX_ERR_NEW_LOAD_BAD_FORMAT", "ordinal": 9}]}, {"object_name": "IREnum", "name": "ToxErrBootstrap", "cname": "Tox_Err_Bootstrap", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_BOOTSTRAP_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "NULL", "cname": "TOX_ERR_BOOTSTRAP_NULL", "ordinal": 1}, {"object_name": "IREnumValue", "name": "BAD_HOST", "cname": "TOX_ERR_BOOTSTRAP_BAD_HOST", "ordinal": 2}, {"object_name": "IREnumValue", "name": "BAD_PORT", "cname": "TOX_ERR_BOOTSTRAP_BAD_PORT", "ordinal": 3}]}, {"object_name": "IREnum", "name": "ToxConnection", "cname": "Tox_Connection", "values": [{"object_name": "IREnumValue", "name": "NONE", "cname": "TOX_CONNECTION_NONE", "ordinal": 0}, {"object_name": "IREnumValue", "name": "TCP", "cname": "TOX_CONNECTION_TCP", "ordinal": 1}, {"object_name": "IREnumValue", "name": "UDP", "cname": "TOX_CONNECTION_UDP", "ordinal": 2}]}, {"object_name": "IREnum", "name": "ToxErrSetInfo", "cname": "Tox_Err_Set_Info", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_SET_INFO_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "NULL", "cname": "TOX_ERR_SET_INFO_NULL", "ordinal": 1}, {"object_name": "IREnumValue", "name": "TOO_LONG", "cname": "TOX_ERR_SET_INFO_TOO_LONG", "ordinal": 2}]}, {"object_name": "IREnum", "name": "ToxErrFriendAdd", "cname": "Tox_Err_Friend_Add", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_FRIEND_ADD_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "NULL", "cname": "TOX_ERR_FRIEND_ADD_NULL", "ordinal": 1}, {"object_name": "IREnumValue", "name": "TOO_LONG", "cname": "TOX_ERR_FRIEND_ADD_TOO_LONG", "ordinal": 2}, {"object_name": "IREnumValue", "name": "NO_MESSAGE", "cname": "TOX_ERR_FRIEND_ADD_NO_MESSAGE", "ordinal": 3}, {"object_name": "IREnumValue", "name": "OWN_KEY", "cname": "TOX_ERR_FRIEND_ADD_OWN_KEY", "ordinal": 4}, {"object_name": "IREnumValue", "name": "ALREADY_SENT", "cname": "TOX_ERR_FRIEND_ADD_ALREADY_SENT", "ordinal": 5}, {"object_name": "IREnumValue", "name": "BAD_CHECKSUM", "cname": "TOX_ERR_FRIEND_ADD_BAD_CHECKSUM", "ordinal": 6}, {"object_name": "IREnumValue", "name": "SET_NEW_NOSPAM", "cname": "TOX_ERR_FRIEND_ADD_SET_NEW_NOSPAM", "ordinal": 7}, {"object_name": "IREnumValue", "name": "MALLOC", "cname": "TOX_ERR_FRIEND_ADD_MALLOC", "ordinal": 8}]}, {"object_name": "IREnum", "name": "ToxErrFriendDelete", "cname": "Tox_Err_Friend_Delete", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_FRIEND_DELETE_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_FOUND", "cname": "TOX_ERR_FRIEND_DELETE_FRIEND_NOT_FOUND", "ordinal": 1}]}, {"object_name": "IREnum", "name": "ToxErrFriendByPublicKey", "cname": "Tox_Err_Friend_By_Public_Key", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_FRIEND_BY_PUBLIC_KEY_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "NULL", "cname": "TOX_ERR_FRIEND_BY_PUBLIC_KEY_NULL", "ordinal": 1}, {"object_name": "IREnumValue", "name": "NOT_FOUND", "cname": "TOX_ERR_FRIEND_BY_PUBLIC_KEY_NOT_FOUND", "ordinal": 2}]}, {"object_name": "IREnum", "name": "ToxErrFriendGetPublicKey", "cname": "Tox_Err_Friend_Get_Public_Key", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_FRIEND_GET_PUBLIC_KEY_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_FOUND", "cname": "TOX_ERR_FRIEND_GET_PUBLIC_KEY_FRIEND_NOT_FOUND", "ordinal": 1}]}, {"object_name": "IREnum", "name": "ToxErrFriendGetLastOnline", "cname": "Tox_Err_Friend_Get_Last_Online", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_FRIEND_GET_LAST_ONLINE_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_FOUND", "cname": "TOX_ERR_FRIEND_GET_LAST_ONLINE_FRIEND_NOT_FOUND", "ordinal": 1}]}, {"object_name": "IREnum", "name": "ToxErrFriendQuery", "cname": "Tox_Err_Friend_Query", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_FRIEND_QUERY_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "NULL", "cname": "TOX_ERR_FRIEND_QUERY_NULL", "ordinal": 1}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_FOUND", "cname": "TOX_ERR_FRIEND_QUERY_FRIEND_NOT_FOUND", "ordinal": 2}]}, {"object_name": "IREnum", "name": "ToxErrSetTyping", "cname": "Tox_Err_Set_Typing", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_SET_TYPING_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_FOUND", "cname": "TOX_ERR_SET_TYPING_FRIEND_NOT_FOUND", "ordinal": 1}]}, {"object_name": "IREnum", "name": "ToxErrFriendSendMessage", "cname": "Tox_Err_Friend_Send_Message", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_FRIEND_SEND_MESSAGE_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "NULL", "cname": "TOX_ERR_FRIEND_SEND_MESSAGE_NULL", "ordinal": 1}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_FOUND", "cname": "TOX_ERR_FRIEND_SEND_MESSAGE_FRIEND_NOT_FOUND", "ordinal": 2}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_CONNECTED", "cname": "TOX_ERR_FRIEND_SEND_MESSAGE_FRIEND_NOT_CONNECTED", "ordinal": 3}, {"object_name": "IREnumValue", "name": "SENDQ", "cname": "TOX_ERR_FRIEND_SEND_MESSAGE_SENDQ", "ordinal": 4}, {"object_name": "IREnumValue", "name": "TOO_LONG", "cname": "TOX_ERR_FRIEND_SEND_MESSAGE_TOO_LONG", "ordinal": 5}, {"object_name": "IREnumValue", "name": "EMPTY", "cname": "TOX_ERR_FRIEND_SEND_MESSAGE_EMPTY", "ordinal": 6}]}, {"object_name": "IREnum", "name": "ToxFileKind", "cname": "Tox_File_Kind", "values": [{"object_name": "IREnumValue", "name": "DATA", "cname": "TOX_FILE_KIND_DATA", "ordinal": 0}, {"object_name": "IREnumValue", "name": "AVATAR", "cname": "TOX_FILE_KIND_AVATAR", "ordinal": 1}]}, {"object_name": "IREnum", "name": "ToxFileControl", "cname": "Tox_File_Control", "values": [{"object_name": "IREnumValue", "name": "RESUME", "cname": "TOX_FILE_CONTROL_RESUME", "ordinal": 0}, {"object_name": "IREnumValue", "name": "PAUSE", "cname": "TOX_FILE_CONTROL_PAUSE", "ordinal": 1}, {"object_name": "IREnumValue", "name": "CANCEL", "cname": "TOX_FILE_CONTROL_CANCEL", "ordinal": 2}]}, {"object_name": "IREnum", "name": "ToxErrFileControl", "cname": "Tox_Err_File_Control", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_FILE_CONTROL_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_FOUND", "cname": "TOX_ERR_FILE_CONTROL_FRIEND_NOT_FOUND", "ordinal": 1}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_CONNECTED", "cname": "TOX_ERR_FILE_CONTROL_FRIEND_NOT_CONNECTED", "ordinal": 2}, {"object_name": "IREnumValue", "name": "NOT_FOUND", "cname": "TOX_ERR_FILE_CONTROL_NOT_FOUND", "ordinal": 3}, {"object_name": "IREnumValue", "name": "NOT_PAUSED", "cname": "TOX_ERR_FILE_CONTROL_NOT_PAUSED", "ordinal": 4}, {"object_name": "IREnumValue", "name": "DENIED", "cname": "TOX_ERR_FILE_CONTROL_DENIED", "ordinal": 5}, {"object_name": "IREnumValue", "name": "ALREADY_PAUSED", "cname": "TOX_ERR_FILE_CONTROL_ALREADY_PAUSED", "ordinal": 6}, {"object_name": "IREnumValue", "name": "SENDQ", "cname": "TOX_ERR_FILE_CONTROL_SENDQ", "ordinal": 7}]}, {"object_name": "IREnum", "name": "ToxErrFileSeek", "cname": "Tox_Err_File_Seek", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_FILE_SEEK_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_FOUND", "cname": "TOX_ERR_FILE_SEEK_FRIEND_NOT_FOUND", "ordinal": 1}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_CONNECTED", "cname": "TOX_ERR_FILE_SEEK_FRIEND_NOT_CONNECTED", "ordinal": 2}, {"object_name": "IREnumValue", "name": "NOT_FOUND", "cname": "TOX_ERR_FILE_SEEK_NOT_FOUND", "ordinal": 3}, {"object_name": "IREnumValue", "name": "DENIED", "cname": "TOX_ERR_FILE_SEEK_DENIED", "ordinal": 4}, {"object_name": "IREnumValue", "name": "INVALID_POSITION", "cname": "TOX_ERR_FILE_SEEK_INVALID_POSITION", "ordinal": 5}, {"object_name": "IREnumValue", "name": "SENDQ", "cname": "TOX_ERR_FILE_SEEK_SENDQ", "ordinal": 6}]}, {"object_name": "IREnum", "name": "ToxErrFileGet", "cname": "Tox_Err_File_Get", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_FILE_GET_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "NULL", "cname": "TOX_ERR_FILE_GET_NULL", "ordinal": 1}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_FOUND", "cname": "TOX_ERR_FILE_GET_FRIEND_NOT_FOUND", "ordinal": 2}, {"object_name": "IREnumValue", "name": "NOT_FOUND", "cname": "TOX_ERR_FILE_GET_NOT_FOUND", "ordinal": 3}]}, {"object_name": "IREnum", "name": "ToxErrFileSend", "cname": "Tox_Err_File_Send", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_FILE_SEND_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "NULL", "cname": "TOX_ERR_FILE_SEND_NULL", "ordinal": 1}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_FOUND", "cname": "TOX_ERR_FILE_SEND_FRIEND_NOT_FOUND", "ordinal": 2}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_CONNECTED", "cname": "TOX_ERR_FILE_SEND_FRIEND_NOT_CONNECTED", "ordinal": 3}, {"object_name": "IREnumValue", "name": "NAME_TOO_LONG", "cname": "TOX_ERR_FILE_SEND_NAME_TOO_LONG", "ordinal": 4}, {"object_name": "IREnumValue", "name": "TOO_MANY", "cname": "TOX_ERR_FILE_SEND_TOO_MANY", "ordinal": 5}]}, {"object_name": "IREnum", "name": "ToxErrFileSendChunk", "cname": "Tox_Err_File_Send_Chunk", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_FILE_SEND_CHUNK_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "NULL", "cname": "TOX_ERR_FILE_SEND_CHUNK_NULL", "ordinal": 1}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_FOUND", "cname": "TOX_ERR_FILE_SEND_CHUNK_FRIEND_NOT_FOUND", "ordinal": 2}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_CONNECTED", "cname": "TOX_ERR_FILE_SEND_CHUNK_FRIEND_NOT_CONNECTED", "ordinal": 3}, {"object_name": "IREnumValue", "name": "NOT_FOUND", "cname": "TOX_ERR_FILE_SEND_CHUNK_NOT_FOUND", "ordinal": 4}, {"object_name": "IREnumValue", "name": "NOT_TRANSFERRING", "cname": "TOX_ERR_FILE_SEND_CHUNK_NOT_TRANSFERRING", "ordinal": 5}, {"object_name": "IREnumValue", "name": "INVALID_LENGTH", "cname": "TOX_ERR_FILE_SEND_CHUNK_INVALID_LENGTH", "ordinal": 6}, {"object_name": "IREnumValue", "name": "SENDQ", "cname": "TOX_ERR_FILE_SEND_CHUNK_SENDQ", "ordinal": 7}, {"object_name": "IREnumValue", "name": "WRONG_POSITION", "cname": "TOX_ERR_FILE_SEND_CHUNK_WRONG_POSITION", "ordinal": 8}]}, {"object_name": "IREnum", "name": "ToxConferenceType", "cname": "Tox_Conference_Type", "values": [{"object_name": "IREnumValue", "name": "TEXT", "cname": "TOX_CONFERENCE_TYPE_TEXT", "ordinal": 0}, {"object_name": "IREnumValue", "name": "AV", "cname": "TOX_CONFERENCE_TYPE_AV", "ordinal": 1}]}, {"object_name": "IREnum", "name": "ToxErrConferenceNew", "cname": "Tox_Err_Conference_New", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_CONFERENCE_NEW_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "INIT", "cname": "TOX_ERR_CONFERENCE_NEW_INIT", "ordinal": 1}]}, {"object_name": "IREnum", "name": "ToxErrConferenceDelete", "cname": "Tox_Err_Conference_Delete", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_CONFERENCE_DELETE_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "CONFERENCE_NOT_FOUND", "cname": "TOX_ERR_CONFERENCE_DELETE_CONFERENCE_NOT_FOUND", "ordinal": 1}]}, {"object_name": "IREnum", "name": "ToxErrConferencePeerQuery", "cname": "Tox_Err_Conference_Peer_Query", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_CONFERENCE_PEER_QUERY_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "CONFERENCE_NOT_FOUND", "cname": "TOX_ERR_CONFERENCE_PEER_QUERY_CONFERENCE_NOT_FOUND", "ordinal": 1}, {"object_name": "IREnumValue", "name": "PEER_NOT_FOUND", "cname": "TOX_ERR_CONFERENCE_PEER_QUERY_PEER_NOT_FOUND", "ordinal": 2}, {"object_name": "IREnumValue", "name": "NO_CONNECTION", "cname": "TOX_ERR_CONFERENCE_PEER_QUERY_NO_CONNECTION", "ordinal": 3}]}, {"object_name": "IREnum", "name": "ToxErrConferenceSetMaxOffline", "cname": "Tox_Err_Conference_Set_Max_Offline", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_CONFERENCE_SET_MAX_OFFLINE_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "CONFERENCE_NOT_FOUND", "cname": "TOX_ERR_CONFERENCE_SET_MAX_OFFLINE_CONFERENCE_NOT_FOUND", "ordinal": 1}]}, {"object_name": "IREnum", "name": "ToxErrConferenceInvite", "cname": "Tox_Err_Conference_Invite", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_CONFERENCE_INVITE_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "CONFERENCE_NOT_FOUND", "cname": "TOX_ERR_CONFERENCE_INVITE_CONFERENCE_NOT_FOUND", "ordinal": 1}, {"object_name": "IREnumValue", "name": "FAIL_SEND", "cname": "TOX_ERR_CONFERENCE_INVITE_FAIL_SEND", "ordinal": 2}, {"object_name": "IREnumValue", "name": "NO_CONNECTION", "cname": "TOX_ERR_CONFERENCE_INVITE_NO_CONNECTION", "ordinal": 3}]}, {"object_name": "IREnum", "name": "ToxErrConferenceJoin", "cname": "Tox_Err_Conference_Join", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_CONFERENCE_JOIN_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "INVALID_LENGTH", "cname": "TOX_ERR_CONFERENCE_JOIN_INVALID_LENGTH", "ordinal": 1}, {"object_name": "IREnumValue", "name": "WRONG_TYPE", "cname": "TOX_ERR_CONFERENCE_JOIN_WRONG_TYPE", "ordinal": 2}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_FOUND", "cname": "TOX_ERR_CONFERENCE_JOIN_FRIEND_NOT_FOUND", "ordinal": 3}, {"object_name": "IREnumValue", "name": "DUPLICATE", "cname": "TOX_ERR_CONFERENCE_JOIN_DUPLICATE", "ordinal": 4}, {"object_name": "IREnumValue", "name": "INIT_FAIL", "cname": "TOX_ERR_CONFERENCE_JOIN_INIT_FAIL", "ordinal": 5}, {"object_name": "IREnumValue", "name": "FAIL_SEND", "cname": "TOX_ERR_CONFERENCE_JOIN_FAIL_SEND", "ordinal": 6}]}, {"object_name": "IREnum", "name": "ToxErrConferenceSendMessage", "cname": "Tox_Err_Conference_Send_Message", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_CONFERENCE_SEND_MESSAGE_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "CONFERENCE_NOT_FOUND", "cname": "TOX_ERR_CONFERENCE_SEND_MESSAGE_CONFERENCE_NOT_FOUND", "ordinal": 1}, {"object_name": "IREnumValue", "name": "TOO_LONG", "cname": "TOX_ERR_CONFERENCE_SEND_MESSAGE_TOO_LONG", "ordinal": 2}, {"object_name": "IREnumValue", "name": "NO_CONNECTION", "cname": "TOX_ERR_CONFERENCE_SEND_MESSAGE_NO_CONNECTION", "ordinal": 3}, {"object_name": "IREnumValue", "name": "FAIL_SEND", "cname": "TOX_ERR_CONFERENCE_SEND_MESSAGE_FAIL_SEND", "ordinal": 4}]}, {"object_name": "IREnum", "name": "ToxErrConferenceTitle", "cname": "Tox_Err_Conference_Title", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_CONFERENCE_TITLE_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "CONFERENCE_NOT_FOUND", "cname": "TOX_ERR_CONFERENCE_TITLE_CONFERENCE_NOT_FOUND", "ordinal": 1}, {"object_name": "IREnumValue", "name": "INVALID_LENGTH", "cname": "TOX_ERR_CONFERENCE_TITLE_INVALID_LENGTH", "ordinal": 2}, {"object_name": "IREnumValue", "name": "FAIL_SEND", "cname": "TOX_ERR_CONFERENCE_TITLE_FAIL_SEND", "ordinal": 3}]}, {"object_name": "IREnum", "name": "ToxErrConferenceGetType", "cname": "Tox_Err_Conference_Get_Type", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_CONFERENCE_GET_TYPE_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "CONFERENCE_NOT_FOUND", "cname": "TOX_ERR_CONFERENCE_GET_TYPE_CONFERENCE_NOT_FOUND", "ordinal": 1}]}, {"object_name": "IREnum", "name": "ToxErrConferenceById", "cname": "Tox_Err_Conference_By_Id", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_CONFERENCE_BY_ID_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "NULL", "cname": "TOX_ERR_CONFERENCE_BY_ID_NULL", "ordinal": 1}, {"object_name": "IREnumValue", "name": "NOT_FOUND", "cname": "TOX_ERR_CONFERENCE_BY_ID_NOT_FOUND", "ordinal": 2}]}, {"object_name": "IREnum", "name": "ToxErrConferenceByUid", "cname": "Tox_Err_Conference_By_Uid", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_CONFERENCE_BY_UID_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "NULL", "cname": "TOX_ERR_CONFERENCE_BY_UID_NULL", "ordinal": 1}, {"object_name": "IREnumValue", "name": "NOT_FOUND", "cname": "TOX_ERR_CONFERENCE_BY_UID_NOT_FOUND", "ordinal": 2}]}, {"object_name": "IREnum", "name": "ToxErrFriendCustomPacket", "cname": "Tox_Err_Friend_Custom_Packet", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_FRIEND_CUSTOM_PACKET_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "NULL", "cname": "TOX_ERR_FRIEND_CUSTOM_PACKET_NULL", "ordinal": 1}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_FOUND", "cname": "TOX_ERR_FRIEND_CUSTOM_PACKET_FRIEND_NOT_FOUND", "ordinal": 2}, {"object_name": "IREnumValue", "name": "FRIEND_NOT_CONNECTED", "cname": "TOX_ERR_FRIEND_CUSTOM_PACKET_FRIEND_NOT_CONNECTED", "ordinal": 3}, {"object_name": "IREnumValue", "name": "INVALID", "cname": "TOX_ERR_FRIEND_CUSTOM_PACKET_INVALID", "ordinal": 4}, {"object_name": "IREnumValue", "name": "EMPTY", "cname": "TOX_ERR_FRIEND_CUSTOM_PACKET_EMPTY", "ordinal": 5}, {"object_name": "IREnumValue", "name": "TOO_LONG", "cname": "TOX_ERR_FRIEND_CUSTOM_PACKET_TOO_LONG", "ordinal": 6}, {"object_name": "IREnumValue", "name": "SENDQ", "cname": "TOX_ERR_FRIEND_CUSTOM_PACKET_SENDQ", "ordinal": 7}]}, {"object_name": "IREnum", "name": "ToxErrGetPort", "cname": "Tox_Err_Get_Port", "values": [{"object_name": "IREnumValue", "name": "OK", "cname": "TOX_ERR_GET_PORT_OK", "ordinal": 0}, {"object_name": "IREnumValue", "name": "NOT_BOUND", "cname": "TOX_ERR_GET_PORT_NOT_BOUND", "ordinal": 1}]}], "exceptions": [{"object_name": "IRException", "name": "ToxOptionsNew", "enum_name": "ToxErrOptionsNew"}, {"object_name": "IRException", "name": "ToxNew", "enum_name": "ToxErrNew"}, {"object_name": "IRException", "name": "ToxBootstrap", "enum_name": "ToxErrBootstrap"}, {"object_name": "IRException", "name": "ToxSetInfo", "enum_name": "ToxErrSetInfo"}, {"object_name": "IRException", "name": "ToxFriendAdd", "enum_name": "ToxErrFriendAdd"}, {"object_name": "IRException", "name": "ToxFriendDelete", "enum_name": "ToxErrFriendDelete"}, {"object_name": "IRException", "name": "ToxFriendByPublicKey", "enum_name": "ToxErrFriendByPublicKey"}, {"object_name": "IRException", "name": "ToxFriendGetPublicKey", "enum_name": "ToxErrFriendGetPublicKey"}, {"object_name": "IRException", "name": "ToxFriendGetLastOnline", "enum_name": "ToxErrFriendGetLastOnline"}, {"object_name": "IRException", "name": "ToxFriendQuery", "enum_name": "ToxErrFriendQuery"}, {"object_name": "IRException", "name": "ToxSetTyping", "enum_name": "ToxErrSetTyping"}, {"object_name": "IRException", "name": "ToxFriendSendMessage", "enum_name": "ToxErrFriendSendMessage"}, {"object_name": "IRException", "name": "ToxFileControl", "enum_name": "ToxErrFileControl"}, {"object_name": "IRException", "name": "ToxFileSeek", "enum_name": "ToxErrFileSeek"}, {"object_name": "IRException", "name": "ToxFileGet", "enum_name": "ToxErrFileGet"}, {"object_name": "IRException", "name": "ToxFileSend", "enum_name": "ToxErrFileSend"}, {"object_name": "IRException", "name": "ToxFileSendChunk", "enum_name": "ToxErrFileSendChunk"}, {"object_name": "IRException", "name": "ToxConferenceNew", "enum_name": "ToxErrConferenceNew"}, {"object_name": "IRException", "name": "ToxConferenceDelete", "enum_name": "ToxErrConferenceDelete"}, {"object_name": "IRException", "name": "ToxConferencePeerQuery", "enum_name": "ToxErrConferencePeerQuery"}, {"object_name": "IRException", "name": "ToxConferenceSetMaxOffline", "enum_name": "ToxErrConferenceSetMaxOffline"}, {"object_name": "IRException", "name": "ToxConferenceInvite", "enum_name": "ToxErrConferenceInvite"}, {"object_name": "IRException", "name": "ToxConferenceJoin", "enum_name": "ToxErrConferenceJoin"}, {"object_name": "IRException", "name": "ToxConferenceSendMessage", "enum_name": "ToxErrConferenceSendMessage"}, {"object_name": "IRException", "name": "ToxConferenceTitle", "enum_name": "ToxErrConferenceTitle"}, {"object_name": "IRException", "name": "ToxConferenceGetType", "enum_name": "ToxErrConferenceGetType"}, {"object_name": "IRException", "name": "ToxConferenceById", "enum_name": "ToxErrConferenceById"}, {"object_name": "IRException", "name": "ToxConferenceByUid", "enum_name": "ToxErrConferenceByUid"}, {"object_name": "IRException", "name": "ToxFriendCustomPacket", "enum_name": "ToxErrFriendCustomPacket"}, {"object_name": "IRException", "name": "ToxGetPort", "enum_name": "ToxErrGetPort"}], "classes": [{"object_name": "IRClass", "name": "ToxOptions", "is_callback": false, "handle": {"object_name": "IRNativeHandle", "alloc_func": {"object_name": "IRFunction", "name": "allocate_native", "cname": "tox_options_new", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "ulong", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "uint64_t", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": {"object_name": "IRType", "name": "ToxOptions", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "struct Tox_Options", "is_pointer": true}, "get_size_func": null, "set_size_func": null}, "param_index": null}, "throws": "ToxOptionsNew", "is_static": true, "params": []}, "dealloc_func": {"object_name": "IRFunction", "name": "deallocate_native", "cname": "tox_options_free", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": true, "params": [{"object_name": "IRParam", "name": "handle", "type": {"object_name": "IRType", "name": "ulong", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "uint64_t", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced_type": {"object_name": "IRType", "name": "ToxOptions", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "struct Tox_Options", "is_pointer": true}, "get_size_func": null, "set_size_func": null}}]}}, "default_init": {"object_name": "IRFunction", "name": "default", "cname": "tox_options_default", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "properties": [{"object_name": "IRProperty", "name": "ipv6_enabled", "is_static": false, "getter": {"object_name": "IRFunction", "name": "get", "cname": "tox_options_get_ipv6_enabled", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "bool", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "bool", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "setter": {"object_name": "IRFunction", "name": "set", "cname": "tox_options_set_ipv6_enabled", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": [{"object_name": "IRParam", "name": "ipv6_enabled", "type": {"object_name": "IRType", "name": "bool", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "bool", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced_type": null}]}}, {"object_name": "IRProperty", "name": "udp_enabled", "is_static": false, "getter": {"object_name": "IRFunction", "name": "get", "cname": "tox_options_get_udp_enabled", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "bool", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "bool", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "setter": {"object_name": "IRFunction", "name": "set", "cname": "tox_options_set_udp_enabled", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": [{"object_name": "IRParam", "name": "udp_enabled", "type": {"object_name": "IRType", "name": "bool", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "bool", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced_type": null}]}}, {"object_name": "IRProperty", "name": "local_discovery_enabled", "is_static": false, "getter": {"object_name": "IRFunction", "name": "get", "cname": "tox_options_get_local_discovery_enabled", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "bool", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "bool", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "setter": {"object_name": "IRFunction", "name": "set", "cname": "tox_options_set_local_discovery_enabled", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": [{"object_name": "IRParam", "name": "local_discovery_enabled", "type": {"object_name": "IRType", "name": "bool", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "bool", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced_type": null}]}}, {"object_name": "IRProperty", "name": "dht_announcements_enabled", "is_static": false, "getter": {"object_name": "IRFunction", "name": "get", "cname": "tox_options_get_dht_announcements_enabled", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "bool", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "bool", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "setter": {"object_name": "IRFunction", "name": "set", "cname": "tox_options_set_dht_announcements_enabled", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": [{"object_name": "IRParam", "name": "dht_announcements_enabled", "type": {"object_name": "IRType", "name": "bool", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "bool", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced_type": null}]}}, {"object_name": "IRProperty", "name": "proxy_type", "is_static": false, "getter": {"object_name": "IRFunction", "name": "get", "cname": "tox_options_get_proxy_type", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "ToxProxyType", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "Tox_Proxy_Type", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "setter": {"object_name": "IRFunction", "name": "set", "cname": "tox_options_set_proxy_type", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": [{"object_name": "IRParam", "name": "type", "type": {"object_name": "IRType", "name": "ToxProxyType", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "Tox_Proxy_Type", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced_type": null}]}}, {"object_name": "IRProperty", "name": "proxy_host", "is_static": false, "getter": {"object_name": "IRFunction", "name": "get", "cname": "tox_options_get_proxy_host", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "char", "mutable": false, "is_array": true, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "char", "is_pointer": true}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "setter": {"object_name": "IRFunction", "name": "set", "cname": "tox_options_set_proxy_host", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": [{"object_name": "IRParam", "name": "host", "type": {"object_name": "IRType", "name": "char", "mutable": false, "is_array": true, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "char", "is_pointer": true}, "get_size_func": {"object_name": "IRFunction", "name": "get", "cname": "tox_max_hostname_length", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "uint", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "uint32_t", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": true, "params": []}, "set_size_func": null}, "replaced_type": null}]}}, {"object_name": "IRProperty", "name": "proxy_port", "is_static": false, "getter": {"object_name": "IRFunction", "name": "get", "cname": "tox_options_get_proxy_port", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "ushort", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "uint16_t", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "setter": {"object_name": "IRFunction", "name": "set", "cname": "tox_options_set_proxy_port", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": [{"object_name": "IRParam", "name": "port", "type": {"object_name": "IRType", "name": "ushort", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "uint16_t", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced_type": null}]}}, {"object_name": "IRProperty", "name": "start_port", "is_static": false, "getter": {"object_name": "IRFunction", "name": "get", "cname": "tox_options_get_start_port", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "ushort", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "uint16_t", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "setter": {"object_name": "IRFunction", "name": "set", "cname": "tox_options_set_start_port", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": [{"object_name": "IRParam", "name": "start_port", "type": {"object_name": "IRType", "name": "ushort", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "uint16_t", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced_type": null}]}}, {"object_name": "IRProperty", "name": "end_port", "is_static": false, "getter": {"object_name": "IRFunction", "name": "get", "cname": "tox_options_get_end_port", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "ushort", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "uint16_t", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "setter": {"object_name": "IRFunction", "name": "set", "cname": "tox_options_set_end_port", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": [{"object_name": "IRParam", "name": "end_port", "type": {"object_name": "IRType", "name": "ushort", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "uint16_t", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced_type": null}]}}, {"object_name": "IRProperty", "name": "tcp_port", "is_static": false, "getter": {"object_name": "IRFunction", "name": "get", "cname": "tox_options_get_tcp_port", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "ushort", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "uint16_t", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "setter": {"object_name": "IRFunction", "name": "set", "cname": "tox_options_set_tcp_port", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": [{"object_name": "IRParam", "name": "tcp_port", "type": {"object_name": "IRType", "name": "ushort", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "uint16_t", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced_type": null}]}}, {"object_name": "IRProperty", "name": "hole_punching_enabled", "is_static": false, "getter": {"object_name": "IRFunction", "name": "get", "cname": "tox_options_get_hole_punching_enabled", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "bool", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "bool", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "setter": {"object_name": "IRFunction", "name": "set", "cname": "tox_options_set_hole_punching_enabled", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": [{"object_name": "IRParam", "name": "hole_punching_enabled", "type": {"object_name": "IRType", "name": "bool", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "bool", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced_type": null}]}}, {"object_name": "IRProperty", "name": "savedata_type", "is_static": false, "getter": {"object_name": "IRFunction", "name": "get", "cname": "tox_options_get_savedata_type", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "ToxSavedataType", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "Tox_Savedata_Type", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "setter": {"object_name": "IRFunction", "name": "set", "cname": "tox_options_set_savedata_type", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": [{"object_name": "IRParam", "name": "type", "type": {"object_name": "IRType", "name": "ToxSavedataType", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "Tox_Savedata_Type", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced_type": null}]}}, {"object_name": "IRProperty", "name": "savedata_data", "is_static": false, "getter": {"object_name": "IRFunction", "name": "get", "cname": "tox_options_get_savedata_data", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "byte", "mutable": false, "is_array": true, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "uint8_t", "is_pointer": true}, "get_size_func": {"object_name": "IRFunction", "name": "get_savedata_length", "cname": "tox_options_get_savedata_length", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "ulong", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "size_t", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "setter": {"object_name": "IRFunction", "name": "set", "cname": "tox_options_set_savedata_data", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": [{"object_name": "IRBufferWrapper", "buffer_param": {"object_name": "IRParam", "name": "data", "type": {"object_name": "IRType", "name": "byte", "mutable": false, "is_array": true, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "uint8_t", "is_pointer": true}, "get_size_func": null, "set_size_func": {"object_name": "IRFunction", "name": "set_savedata_length", "cname": "tox_options_set_savedata_length", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": [{"object_name": "IRParam", "name": "length", "type": {"object_name": "IRType", "name": "ulong", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "size_t", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced_type": null}]}}, "replaced_type": null}, "length_param": {"object_name": "IRParam", "name": "length", "type": {"object_name": "IRType", "name": "ulong", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "size_t", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced_type": null}}]}}, {"object_name": "IRProperty", "name": "log_callback", "is_static": false, "getter": {"object_name": "IRFunction", "name": "get", "cname": "tox_options_get_log_callback", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "ToxLogCb", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "tox_log_cb", "is_pointer": true}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "setter": {"object_name": "IRFunction", "name": "set", "cname": "tox_options_set_log_callback", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": [{"object_name": "IRParam", "name": "callback", "type": {"object_name": "IRType", "name": "ToxLogCb", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "tox_log_cb", "is_pointer": true}, "get_size_func": null, "set_size_func": null}, "replaced_type": null}]}}, {"object_name": "IRProperty", "name": "log_user_data", "is_static": false, "getter": {"object_name": "IRFunction", "name": "get", "cname": "tox_options_get_log_user_data", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": true}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": []}, "setter": {"object_name": "IRFunction", "name": "set", "cname": "tox_options_set_log_user_data", "return_type": {"object_name": "IRReturnType", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, "contains_number_handle": false, "ctype": {"object_name": "CType", "name": "void", "is_pointer": false}, "get_size_func": null, "set_size_func": null}, "replaced": null, "param_index": null}, "throws": null, "is_static": false, "params": [{"object_name": "IRParam", "name": "user_data", "type": {"object_name": "IRType", "name": "void", "mutable": true, "is_array": false, "acts_as_string": false, 